# Используем официальный базовый образ Python версии 3.10
FROM python:3.10-slim

# Устанавливаем рабочую директорию внутри контейнера
# Все последующие команды будут выполняться здесь
WORKDIR /app

# Копируем файл зависимостей в контейнер
# (копируем отдельно для кэширования установки зависимостей)
COPY requirements.txt .

# Устанавливаем зависимости из requirements.txt
# --no-cache-dir экономит место
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь проект внутрь контейнера
COPY . .

# Команда, которая будет выполняться при запуске контейнера
# В данном проекте мы просто запускаем app.py
CMD ["python", "app.py"]
